meeting/agenda/2026/05-19.org
:PROPERTIES:
:ID:       C850A7AE-702B-48F4-A2F2-1AF722CEB138
:END:
#+title: QT4 CG Meeting 165 Agenda 2026-05-19
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2026/05-12.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 19 May 2026.

The next meeting is planned for 26 May 2026.

** Review of open action items [1/12]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [ ] QT4CG-160-02: NW to think about how to promote the dated drafts for broader community feedback.

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2594][#2594]]: 2389 Adaptive Serialization: more freedom
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array
+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2640][#2640]]: Remove space in function declaration between EQName & params

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array
+ PR [[https://qt4cg.org/dashboard/#pr-2566][#2566]]: 1979 Records with type annotations
+ PR [[https://qt4cg.org/dashboard/#pr-2589][#2589]]: 2587 Streamability of context value expressions
+ PR [[https://qt4cg.org/dashboard/#pr-2611][#2611]]: 2598 New function fn:regex
+ PR [[https://qt4cg.org/dashboard/#pr-2626][#2626]]: 2625 Make arguments of fn:substring be xs:numeric
+ PR [[https://qt4cg.org/dashboard/#pr-2627][#2627]]: 2624 Change error codes XPTY0019 and -0020 to XPTY0004
+ PR [[https://qt4cg.org/dashboard/#pr-2628][#2628]]: 2617 Duration multiplied or divided by number
+ PR [[https://qt4cg.org/dashboard/#pr-2633][#2633]]: 2632-1: fix critical bugs and DTD-validity issues
+ PR [[https://qt4cg.org/dashboard/#pr-2634][#2634]]: 2632-2: fix broken examples in expressions.xml
+ PR [[https://qt4cg.org/dashboard/#pr-2635][#2635]]: 2632-3: typos and grammar
+ PR [[https://qt4cg.org/dashboard/#pr-2636][#2636]]: 2632-4: logic and semantics
+ PR [[https://qt4cg.org/dashboard/#pr-2637][#2637]]: 2632-5: refresh stale 4.0 content
+ PR [[https://qt4cg.org/dashboard/#pr-2638][#2638]]: 2632-6: cross-cutting consistency

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Group policy on commecial LLM-generated content
:PROPERTIES:
:CUSTOM_ID: llm-generated
:END:

PRs #2633-#2638 reflect the output of a commercial LLM. The community group
should decide, before discussing these items, what its policy is going to be on
LLM generated content. This is a policy choice that needs to be made first
because accepting them, or not, will /establish/ a policy.

** PR #2611: 2598 New function fn:regex
:PROPERTIES:
:CUSTOM_ID: pr-2611
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2611][#2611]].
** PR #2566: 1979 Records with type annotations
:PROPERTIES:
:CUSTOM_ID: pr-2566
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2566][#2566]].
** PR #2626: 2625 Make arguments of fn:substring be xs:numeric
:PROPERTIES:
:CUSTOM_ID: pr-2626
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2626][#2626]].
** PR #2627: 2624 Change error codes XPTY0019 and -0020 to XPTY0004
:PROPERTIES:
:CUSTOM_ID: pr-2627
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2627][#2627]].
** PR #2628: 2617 Duration multiplied or divided by number
:PROPERTIES:
:CUSTOM_ID: pr-2628
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2628][#2628]].
** PR #2019: 1776: XSLT template rules for maps and array
:PROPERTIES:
:CUSTOM_ID: pr-2019
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]].
** PR #2589: 2587 Streamability of context value expressions
:PROPERTIES:
:CUSTOM_ID: pr-2589
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2589][#2589]].
** PR #2633: 2632-1: fix critical bugs and DTD-validity issues
:PROPERTIES:
:CUSTOM_ID: pr-2633
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2633][#2633]].
** PR #2634: 2632-2: fix broken examples in expressions.xml
:PROPERTIES:
:CUSTOM_ID: pr-2634
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2634][#2634]].
** PR #2635: 2632-3: typos and grammar
:PROPERTIES:
:CUSTOM_ID: pr-2635
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2635][#2635]].
** PR #2636: 2632-4: logic and semantics
:PROPERTIES:
:CUSTOM_ID: pr-2636
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2636][#2636]].
** PR #2637: 2632-5: refresh stale 4.0 content
:PROPERTIES:
:CUSTOM_ID: pr-2637
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2637][#2637]].
** PR #2638: 2632-6: cross-cutting consistency
:PROPERTIES:
:CUSTOM_ID: pr-2638
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2638][#2638]].


* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
