meeting/agenda/2026/05-19.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 165 Agenda 2026-05-19</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 165 Agenda 2026-05-19</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>
<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>
<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2026/05-12.html">the previous meeting</a>.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 19 May 2026.
</p>

<p>
The next meeting is planned for 26 May 2026.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/12]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-160-02: NW to think about how to promote the dated drafts for broader community feedback.</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2594">#2594</a>: 2389 Adaptive Serialization: more freedom</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2640">#2640</a>: Remove space in function declaration between EQName &amp; params</li>
</ul>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.3.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2566">#2566</a>: 1979 Records with type annotations</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2589">#2589</a>: 2587 Streamability of context value expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2611">#2611</a>: 2598 New function fn:regex</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2626">#2626</a>: 2625 Make arguments of fn:substring be xs:numeric</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2627">#2627</a>: 2624 Change error codes XPTY0019 and -0020 to XPTY0004</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2628">#2628</a>: 2617 Duration multiplied or divided by number</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2633">#2633</a>: 2632-1: fix critical bugs and DTD-validity issues</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2634">#2634</a>: 2632-2: fix broken examples in expressions.xml</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2635">#2635</a>: 2632-3: typos and grammar</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2636">#2636</a>: 2632-4: logic and semantics</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2637">#2637</a>: 2632-5: refresh stale 4.0 content</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2638">#2638</a>: 2632-6: cross-cutting consistency</li>
</ul>
</div>
</div>
<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.4.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>: Shallow copy in XSLT with maps and arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-llm-generated" class="outline-3">
<h3 id="llm-generated"><span class="section-number-3">2.1.</span> Group policy on commecial LLM-generated content</h3>
<div class="outline-text-3" id="text-llm-generated">
<p>
PRs #2633-#2638 reflect the output of a commercial LLM. The community group
should decide, before discussing these items, what its policy is going to be on
LLM generated content. This is a policy choice that needs to be made first
because accepting them, or not, will <i>establish</i> a policy.
</p>
</div>
</div>
<div id="outline-container-pr-2611" class="outline-3">
<h3 id="pr-2611"><span class="section-number-3">2.2.</span> PR #2611: 2598 New function fn:regex</h3>
<div class="outline-text-3" id="text-pr-2611">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2611">#2611</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2566" class="outline-3">
<h3 id="pr-2566"><span class="section-number-3">2.3.</span> PR #2566: 1979 Records with type annotations</h3>
<div class="outline-text-3" id="text-pr-2566">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2566">#2566</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2626" class="outline-3">
<h3 id="pr-2626"><span class="section-number-3">2.4.</span> PR #2626: 2625 Make arguments of fn:substring be xs:numeric</h3>
<div class="outline-text-3" id="text-pr-2626">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2626">#2626</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2627" class="outline-3">
<h3 id="pr-2627"><span class="section-number-3">2.5.</span> PR #2627: 2624 Change error codes XPTY0019 and -0020 to XPTY0004</h3>
<div class="outline-text-3" id="text-pr-2627">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2627">#2627</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2628" class="outline-3">
<h3 id="pr-2628"><span class="section-number-3">2.6.</span> PR #2628: 2617 Duration multiplied or divided by number</h3>
<div class="outline-text-3" id="text-pr-2628">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2628">#2628</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2019" class="outline-3">
<h3 id="pr-2019"><span class="section-number-3">2.7.</span> PR #2019: 1776: XSLT template rules for maps and array</h3>
<div class="outline-text-3" id="text-pr-2019">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2589" class="outline-3">
<h3 id="pr-2589"><span class="section-number-3">2.8.</span> PR #2589: 2587 Streamability of context value expressions</h3>
<div class="outline-text-3" id="text-pr-2589">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2589">#2589</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2633" class="outline-3">
<h3 id="pr-2633"><span class="section-number-3">2.9.</span> PR #2633: 2632-1: fix critical bugs and DTD-validity issues</h3>
<div class="outline-text-3" id="text-pr-2633">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2633">#2633</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2634" class="outline-3">
<h3 id="pr-2634"><span class="section-number-3">2.10.</span> PR #2634: 2632-2: fix broken examples in expressions.xml</h3>
<div class="outline-text-3" id="text-pr-2634">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2634">#2634</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2635" class="outline-3">
<h3 id="pr-2635"><span class="section-number-3">2.11.</span> PR #2635: 2632-3: typos and grammar</h3>
<div class="outline-text-3" id="text-pr-2635">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2635">#2635</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2636" class="outline-3">
<h3 id="pr-2636"><span class="section-number-3">2.12.</span> PR #2636: 2632-4: logic and semantics</h3>
<div class="outline-text-3" id="text-pr-2636">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2636">#2636</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2637" class="outline-3">
<h3 id="pr-2637"><span class="section-number-3">2.13.</span> PR #2637: 2632-5: refresh stale 4.0 content</h3>
<div class="outline-text-3" id="text-pr-2637">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2637">#2637</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2638" class="outline-3">
<h3 id="pr-2638"><span class="section-number-3">2.14.</span> PR #2638: 2632-6: cross-cutting consistency</h3>
<div class="outline-text-3" id="text-pr-2638">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2638">#2638</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
